# День 5 (22 Июля): Управление потоком (Условия и Циклы)

Вчера мы узнали, как хранить данные в памяти. Но программа, которая просто хранит данные, бесполезна. Она должна принимать решения. Сегодня мы изучаем Control Flow (Управление потоком выполнения).

## 🎯 Цели на сегодня
1. Понять, как Python принимает решения (`if/elif/else`).
2. Разобраться с автоматизацией рутины (`for` и `while`).
3. Понять, почему `while True` может "убить" ваш компьютер.

---

## 🧠 Теория (Глубокое погружение)

### 1. Логические операторы и Ветвления
Компьютер понимает только `True` (Истина) или `False` (Ложь). 
Конструкция `if` работает как охранник в клубе:
```python
age = 18
if age >= 18:
    print("Добро пожаловать")
elif age == 17:
    print("Приходи через год")
else:
    print("Вход запрещен")
```
**Важно:** В Python нет фигурных скобок `{}`. Вложенность определяется **отступами** (4 пробела). Если вы ошибетесь на один пробел, программа упадет (IndentationError).

### 2. Цикл FOR (Итерация по коллекциям)
Цикл `for` в Python не похож на циклы в других языках (где вы считаете `i=0; i<10`). В Python `for` берет коллекцию (например, список из Дня 4) и по очереди вытаскивает оттуда элементы.
```python
users = ["Ega", "Hip", "Par"]
for user in users:
    print(f"Привет, {user}!")
```

### 3. Цикл WHILE (Бесконечный луп)
Цикл `while` работает, пока условие равно `True`. 
Если вы напишете `while True: print("Hello")`, программа будет выводить текст бесконечно, пока не съест всю оперативную память (или пока вы не нажмете `Ctrl+C` в терминале).
В реальном Backend'е бесконечные циклы `while True` используются для работы серверов (сервер "бесконечно" слушает новые запросы).

---

## 🛠️ Практика (Задание на сегодня)

1. Откройте Терминал и создайте файл `loops.py`.
2. Напишите программу, которая:
   - Создает список из 5 любых чисел.
   - С помощью цикла `for` проходится по списку.
   - Внутри цикла использует `if`, чтобы проверять: если число четное — выводить "Четное", если нечетное — "Нечетное".
3. *(Бонус)*: Добавьте счетчик `while`, который 3 раза спросит у пользователя пароль (через функцию `input()`). Если пароль неверный 3 раза — программа завершается.

---

### 🔥 Хардкор-миссия (Для Ega)
Напиши скрипт `password_validator.py`. Программа просит пользователя придумать пароль (через `input()`). 
Затем она проверяет пароль по условиям:
1. Длина строго больше 8 символов (гугли встроенную функцию `len()`).
2. Пароль не должен равняться строке "password", "qwerty" или "12345678".
Если всё ок, выведи `Успех! Пароль надежен`. Если нет, выведи `Ошибка:` и конкретно объясни пользователю, какое из двух правил он нарушил. Используй цепочку `if-elif-else`.

---

## ✅ Контрольная проверка (Assessment)
Вы закончили День 5, если можете ответить вслух:
1. Что произойдет, если внутри блока `if` вы поставите 3 пробела вместо 4?
2. В чем принципиальная разница между циклом `for` и циклом `while`? В каком случае вы выберете `while`?
3. Ваш код запушен в новую ветку и получил Аппрув от напарника? (Не забудьте про Pull Request!).

---
🔗 **Следующий шаг:** `Day_06_Python_Functions_Scope.md` (Будет доступно завтра).
